Table of Contents
 Enum LongReinfEndType
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
End type of longitudional reinforcement
public enum LongReinfEndType
Fields
Bend = 1
Bend
ContinuousBar = 5
Continuous bar - full anchorage
ContinuousBarOutside = 6
Continuous bar outside - no anchorage
Hook = 2
Hook
Hook180DegreeACI = 8
180 degree hook for ACI
Hook90DegreeACI = 7
90 degree hook for ACI
Loop = 3
Loop
None = 0
None
WeldedTransverseBar = 4
WeldedTransverseBar
Fields
 Name |  Description
 Bend = 1
Bend
 ContinuousBar = 5
Continuous bar - full anchorage
 ContinuousBarOutside = 6
Continuous bar outside - no anchorage
 Hook = 2
Hook
 Hook180DegreeACI = 8
180 degree hook for ACI
 Hook90DegreeACI = 7
90 degree hook for ACI
 Loop = 3
Loop
 None = 0
None
 WeldedTransverseBar = 4
WeldedTransverseBar
 Edit this page